In [1]:
import pandas as pd
import numpy as np
import requests

### Read CSV File

In [2]:
df1 = pd.read_csv('data/Example.csv')
df1.name = 'csv_dataframe'
df1

   EmployeeID           Name  Age   Department  Salary
0           1  Alice Johnson   29  Engineering   85000
1           2      Bob Smith   35    Marketing   72000
2           3    Charlie Lee   40      Finance   95000
3           4   Diana Prince   27           HR   62000

In [3]:
assert(df1.shape == (4,5))
assert(list(df1['Name']) == ['Alice Johnson', 'Bob Smith', 'Charlie Lee', 'Diana Prince'])
assert(list(df1['Age']) == [29,35,40,27])
assert(list(df1['Department']) == ["Engineering", "Marketing", "Finance", "HR"])
assert(list(df1['Salary']) == [85000,72000,95000,62000])

### Read JSON File

In [4]:
df2 = pd.read_json('data/Example.json')
df2.name = 'json_dataframe'
df2

   EmployeeID           Name  Age   Department  Salary
0           1  Alice Johnson   29  Engineering   85000
1           2      Bob Smith   35    Marketing   72000
2           3    Charlie Lee   40      Finance   95000
3           4   Diana Prince   27           HR   62000

### Read Parquet

In [5]:
df3 = pd.read_parquet('data/Example.parquet')
df3.name = 'parquet_dataframe'
df3

   EmployeeID           Name  Age   Department  Salary
0           1  Alice Johnson   29  Engineering   85000
1           2      Bob Smith   35    Marketing   72000
2           3    Charlie Lee   40      Finance   95000
3           4   Diana Prince   27           HR   62000

### Append all dataframes into a list

In [6]:
l = []
l.append(df1)
l.append(df2)
l.append(df3)

### Print Dataframe Metadata

In [7]:
print('*' * 100)
i = 1
for x in l:
    print('Dataframe name: ' + str(x.name))
    print('Dataframe shape: ' + str(x.shape))
    print('Dataframe columns: ' + str(x.columns))
    print('Dataframe dtypes: ' + str(x.dtypes))
    print('Object type: ' + str(type(x)))
    print('*' * 100)
    i+=1

****************************************************************************************************
Dataframe name: csv_dataframe
Dataframe shape: (4, 5)
Dataframe columns: Index(['EmployeeID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')
Dataframe dtypes: EmployeeID     int64
Name          object
Age            int64
Department    object
Salary         int64
dtype: object
Object type: <class 'pandas.core.frame.DataFrame'>
****************************************************************************************************
Dataframe name: json_dataframe
Dataframe shape: (4, 5)
Dataframe columns: Index(['EmployeeID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')
Dataframe dtypes: EmployeeID     int64
Name          object
Age            int64
Department    object
Salary         int64
dtype: object
Object type: <class 'pandas.core.frame.DataFrame'>
****************************************************************************************************
Dataframe name: parquet_dataframe
Dataframe shape: (4, 5)
Dataframe columns: Index(['EmployeeID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')
Dataframe dtypes: EmployeeID     int64
Name          object
Age            int64
Department    object
Salary         int64
dtype: object
Object type: <class 'pandas.core.frame.DataFrame'>
****************************************************************************************************

### Connect to REST APIs (Async vs Non-Async)

In [ ]:
#python async.py
#Executing REST API call in async.py to http://127.0.0.1:5000/random-user for 2000 iterations.

<details><summary>See Execution Time</summary>Total Execution Time for async.py: 4.60 second</details>

In [ ]:
#python non-async.py
#Executing REST API call in non-async.py to http://127.0.0.1:5000/random-user for 2000 iterations.

<details><summary>See Execution Time</summary>Total Execution Time for non-async.py: 9.70 second</details>

### Connect to REST APIs (with Authentication)

In [8]:
import requests

BASE_URL = "http://127.0.0.1:5000"

# 1. Request without a token (should be unauthorized)
response = requests.get(f"{BASE_URL}/protected")
print("Without Token:", response.status_code, response.json())

# 2. Request with a valid token
headers = {
    "Authorization": "Bearer mysecrettoken123"
}
response = requests.get(f"{BASE_URL}/protected", headers=headers)
print("With Token:", response.status_code, response.json())

# 3. Accessing the public endpoint (no authentication required)
response = requests.get(f"{BASE_URL}/public")
print("Public Endpoint:", response.status_code, response.json())

Without Token: 401 {'error': 'Invalid or missing token', 'message': 'Unauthorized Access'}
With Token: 200 {'message': 'Access granted!', 'user': 'authorized_user'}
Public Endpoint: 200 {'message': 'This is a public endpoint!'}

# Load REST Data to SQLite

In [9]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///Example.db', echo=False)

In [10]:
url = "http://127.0.0.1:5000/random-user"  
num_iterations = 100

df = pd.DataFrame()

for x in range(num_iterations):
    r = requests.get(url)
    json_data = r.json()
    df = pd.concat([df, pd.DataFrame([json_data])], ignore_index=True)

df.to_sql(name='random-users', con=engine, if_exists='replace',index_label='id')

100